app/controllers/admin/articles_controller.rb

SELECT * FROM "articles" WHERE ("articles"."id" = 2)
DELETE FROM "articles" WHERE "id" = 2
---
  def delete
    @article = Article.find(params[:id])
    @article.destroy