app/controllers/articles_controller.rb

  def download_article
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)